{"id":"mohammed_anwar_ghrawi","source_file":"mohammed_anwar_al-ghrawi.txt","role":"","personal_info":{"name":"Mohammed Anwar AL -Ghrawi","email":"anwarghrawi66@gmail.com","phone":"+963 998 555 587","location":""},"summary":"I am a Control Engineering graduate with a strong focus on AI, generative AI, and computer vision. Proficient in Python, C, and C++, I specialize in developing innovative solutions using large language models and advanced AI technologies. I am passionate about driving technological progress and creating impactful AI-driven applications.","skills":{"technical":["Python","C++","C","C#","Java","MySQL","Git","Github","Linux","OpenCV","PyTorch","TensorFlow","Keras","NLTK","SpaCy","Transformers","Hugging Face tools"],"soft":[]},"experience":[{"job_title":"Volunteer","company":"RBCs Team","dates":"2020 - 2022","bullets":["Assisted fellow students with academic projects, offering guidance and support to help them succeed in their work."]}],"education":[{"degree":"Bachelor of Engineering in Computers and Automation","institution":"Damascus University","dates":"(2019 – 2024)"}],"certifications":[],"projects":[{"name":"Remi virtual assistant","description":"An AI-powered virtual assistant using LLaMA-3 with Retrieval-Augmented Generation (RAG) and text-to-speech integration. Implemented voice interactions in Unity and text-based communication through a Telegram chatbot.","tools_used":["Unity 3D","Python","Telegram Bot API","Pytorch","Transformers library","Large language models"]},{"name":"FaceID","description":"Face Recognition Attendance System using Python, OpenCV, and face_recognition for real-time employee tracking. Integrated a Telegram bot for data registration, and all attendance records were stored in a CSV file.","tools_used":["Python","Telegram Bot API","Dlib","scikit-learn","pandas","matplotlib"]},{"name":"Trigger word detection model","description":"Created a TensorFlow-based wake word detection system using GRU units and spectrogram features for audio classification. Integrated data preprocessing techniques including DeepFilterNet and data augmentation.","tools_used":["TensorFlow","Librosa","DeepFilterNet","pandas","matplotlib","Pydub","CNN","GRU","LSTM"]},{"name":"Intent Recognition model","description":"Developed a machine learning model designed to identify user intents based on natural language input. The model leverages deep learning techniques and semantic analysis to accurately classify and interpret user commands.","tools_used":["TensorFlow","scikit-learn","spaCy"]}],"languages":[],"side_notes":""}